{
    "courses": [
      {
        "id": "1",
        "image": "1.jpg",
        "name": "Data Science на Python 3 с нуля",
        "description": "Готовы ли вы начать свой путь, чтобы стать Data Scientist?\n\nЭтот всеобъемлющий курс станет вашим руководством к изучению того, как использовать возможности Python для анализа данных, создания красивых визуализаций и использования мощных алгоритмов машинного обучения!\n\nЭтот курс предназначен как для начинающих, имеющих некоторый опыт программирования, так и для опытных разработчиков, стремящихся изучить Data Science!\n\n",
        "price": 600.23,
        "date": "2020, 06, 11",
        "available": true,
        "category": "Data Science"
      },
      {
        "id": "2",
        "image": "2.jpg",
        "name": "Полный курс по веб разработке с нуля на Python + Django",
        "description": "Добро пожаловать на курс \"Python в веб - с нуля до создания приложений. Python+Django\"! В этом курсе мы рассмотрим все, что вам нужно знать, чтобы создать сайт с использованием Python, Django и многих других веб-технологий!\n\nМы изучим новейшие технологии для создания великолепных веб-приложений на Python и Django! Но мы изучим не только это, мы также изучим веб технологии, которые вам необходимо знать, включая HTML, CSS и Bootstrap!\n\nЭтот курс разработан таким образом, чтобы каждый мог стать веб-разработчиком. Вы научитесь программировать с помощью видеолекций в формате HD, проектов пошагового кода, упражнений, слайдов с презентациями концепций и многого другого!",
        "price": 200.23,
        "date": "2020, 02, 12",
        "available": true,
        "category": "Web"
      },
      {
        "id": "3",
        "image": "3.jpg",
        "name": "Angular 9. Теория и Практика 2020. Все включено",
        "description": "Данный курс не требует никаких предварительных знаний по Angular или другим фреймворкам. Все дано с нуля\n\nКурс содержит в себе более 17 часов обучающих материалов, которые последовательно и очень подробно научат вас самым актуальным знаниям по прекрасной Frontend технологии Angular от компании Google.\n\nИз предварительных знаний только основы. Остальное в курсе рассказывается с самого нуля, включая TypeScript и RxJS\n\nПрактике предшествует 13 теоретических блоков, где максимально подробно разобраны и систематизированы в виде пошаговой целостной системы все тонкости фреймворка на различных примерах.",
        "price": 300.23,
        "date": "2020, 02, 13",
        "available": true,
        "category": "Web Development"
      },
      {
        "id": "4",
        "image": "4.jpg",
        "name": "Практический курс по созданию iOS приложения на swift 22 часа",
        "description": "Курс подойдет как для новичков, которые хотят выучить Swift, так и для тех, кто знает Java или другой язык программирования.\n\nДанный курс выполняет главный шаг: вы поймете основные моменты Swift и получите опыт разработки, который уже потом будете использовать в изучении iOS.\n\nЭто не обычный перевод официальной документации, которым занимаются многие компании и разработчики. А полноценный курс, созданный с нуля и с правильной последовательностью.",
        "price": 400.23,
        "date": "2020.04.14",
        "available": true,
        "category": "Mobile Development"
      },
      {
        "id": "5",
        "image": "5.jpg",
        "name": "C++ Основы многопоточного программирования",
        "description": "Основы многопоточного программирования в C++  для начинающих разработчиков.\n\nИзучив курс вы получите знания, понимание и навыки работы с потоками в C++, а так же узнаете об основных проблемах многопоточного программирования и способах их решения.\n\nВ данном курсе простыми словами на простых примерах показано для чего нужны потоки, как они работают, а так же особенности синхронизации работы потоков.",
        "price": 500.23,
        "date": "2020.12.15",
        "available": true,
        "category": "Programming6"
      },
      {
        "id": "6",
        "image": "6.jpg",
        "name": "Android разработка на Kotlin - с нуля до продвинутого уровня",
        "description": "Добро пожаловать на курс \"Android разработка на Kotlin - с нуля до продвинутого уровня\". Независимо от того, являетесь ли вы разработчиком на Java или не имеете опыта работы с Android, мы начнем с нуля и изучим всё, что вам нужно знать, чтобы создавать приложения с использованием Kotlin.\n\nЧто вы получите в этом курсе?\n\nВ этом курсе вы познакомитесь с возможностями разработки приложений для Android и приобретете навыки, которые позволят вам значительно повысить свои карьерные перспективы в качестве разработчика программного обеспечения.",
        "price": 600.23,
        "date": "2020.06.16",
        "available": true,
        "category": "Data Science"
      }
    ]
  }
